cases/wallFireSpread2D/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    wall           
    {
    //	type			fixedFluxBuoyantPressure;
        type            fixedFluxPressure;
        value			$internalField;
    }

    outlet          
    {
        //type			zeroGradient;
        type            fixedFluxPressure;
        value			$internalField;
    }

    ground           
    {
        type            fixedFluxPressure;
        value			$internalField;
    }

    side          
    {
        type            totalPressure;
        U               U;
        phi             phi;
        rho             rho;
        psi             none;
        gamma           0;//1.4;
        p0	        $internalField;
        value		$internalField;
    }

    frontAndBack    
    {
        type            empty;
    }

    burner          
    {
        type            fixedFluxPressure;
        value			$internalField;
    }
    region0_to_panelRegion_panel
    {
    //	type			fixedFluxBuoyantPressure;
        type            fixedFluxPressure;
        value			$internalField;
    }
}


// ************************************************************************* //
