cases/wallFireSpread2D/constant/combustionProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      combustionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

combustionModel  eddyDissipationModel<psiThermoCombustion,gasHThermoPhysics>;

eddyDissipationModelCoeffs
{
    semiImplicit no;
    C_EDC       4.0;
    C_Diff      0.5; //0;        //small number to turn off
    C_Stiff     1; //0.5e-10;    //small number to turn off
}

noCombustionCoeffs
{
}


// ************************************************************************* //
