cases/wallFireSpread2D/constant/polyMesh/blockMeshDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
    (0 0 0   ) // 0
    (1 0 0   ) // 1
    (1 0 0.2 ) // 2
    (0 0 0.2 ) // 3
    (0 2 0   ) // 4
    (1 2 0   ) // 5
    (1 2 0.2 ) // 6
    (0 2 0.2 ) // 7
);

blocks          
(
    hex (0 3 2 1 4 7 6 5)   (1 20 40) simpleGrading (1 1 1)
);

edges           
(
);

patches         
(
    wall wall 
    (
        (0 3 7 4)
    )

    patch side
    (
        (1 5 6 2)
    )

    empty frontAndBack
    //cyclic sides
    (
        (0 4 5 1)
        (7 3 2 6)
    )

    patch outlet
    (
        (4 7 6 5)
    )

    wall ground
    (
       (0 1 2 3)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
