cases/wallFireSpread2D/system/burner.setSet
faceSet burnerFace new boxToFace (-0.1 -0.1 -0.1)(0.201 0.01 2.51 )

