cases/wallFireSpread2D/system/extrudeToRegionMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      extrudeToRegionMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

region          panelRegion;

//faceZones       (coupledPatch);
faceZones       (panel);

oneD            true;

sampleMode      nearestPatchFace;

extrudeModel    linearNormal;

oneDPolyPatchType empty; //wedge

nLayers         8;

expansionRatio  1;

adaptMesh       true; // directMapped for both

linearNormalCoeffs
{
//    thickness       0.0234;
    thickness       0.0039;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
