cases/wallFireSpread2D/system/panel.setSet
faceSet panel new boxToFace (-0.1 0.09 -0.1 )(0.01 0.61 2.51 )
faceZoneSet panel new setToFaceZone panel
